; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v3 - type_3 ?v5 - type_1)
 	      (pred_3 ?v7 - object ?v5 - type_1)
	      (pred_1 ?v3 - type_3 ?v8 - type_2)
	      (pred_2 ?v3 - type_3 ?v7 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v3 - type_3 ?v6 ?v2 - type_1)
       :precondition (and  (pred_4 ?v3 ?v6))
       :effect (and  (pred_4 ?v3 ?v2)
		     (not (pred_4 ?v3 ?v6))))

   (:action op_2
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v1) (pred_4 ?v3 ?v1) (pred_1 ?v3 ?v8))
       :effect (and (pred_2 ?v3 ?v4 ?v8)
		    (not (pred_3 ?v4 ?v1)) 
		    (not (pred_1 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_3 ?v4 - object ?v1 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v4 ?v8) (pred_4 ?v3 ?v1))
       :effect (and (pred_3 ?v4 ?v1)
		    (pred_1 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v4 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_11 - type_3
obj_01 obj_06 obj_02 obj_08 - type_2
obj_13 obj_03 obj_05 obj_12 - type_1
obj_07 obj_04 obj_09 - object)
(:init
(pred_4 obj_10 obj_05)
(pred_1 obj_10 obj_01)
(pred_1 obj_10 obj_06)
(pred_4 obj_11 obj_12)
(pred_1 obj_11 obj_02)
(pred_1 obj_11 obj_08)
(pred_3 obj_07 obj_03)
(pred_3 obj_04 obj_12)
(pred_3 obj_09 obj_12)
)
(:goal
(and
(pred_3 obj_07 obj_13)
(pred_3 obj_04 obj_12)
(pred_3 obj_09 obj_05)
)
)

(:constraints
  (always (not (pred_4 obj_10 obj_03)))
)
)

; plan
1. (op_2 obj_11 obj_09 obj_12 obj_08)
   deleted: (pred_3 obj_09 obj_12) (pred_1 obj_11 obj_08)
   added: (pred_2 obj_11 obj_09 obj_08)
   goals met: 1 of 3
2. (op_3 obj_10 obj_05 obj_13)
   deleted: (pred_4 obj_10 obj_05)
   added: (pred_4 obj_10 obj_13)
   goals met: 1 of 3
3. (op_3 obj_11 obj_12 obj_05)
   deleted: (pred_4 obj_11 obj_12)
   added: (pred_4 obj_11 obj_05)
   goals met: 1 of 3
4. (op_1 obj_11 obj_09 obj_05 obj_08)
   deleted: (pred_2 obj_11 obj_09 obj_08)
   added: (pred_3 obj_09 obj_05) (pred_1 obj_11 obj_08)
   goals met: 2 of 3
5. (op_3 obj_11 obj_05 obj_03)
   deleted: (pred_4 obj_11 obj_05)
   added: (pred_4 obj_11 obj_03)
   goals met: 2 of 3
6. (op_2 obj_11 obj_07 obj_03 obj_08)
   deleted: (pred_3 obj_07 obj_03) (pred_1 obj_11 obj_08)
   added: (pred_2 obj_11 obj_07 obj_08)
   goals met: 2 of 3
7. (op_3 obj_11 obj_03 obj_13)
   deleted: (pred_4 obj_11 obj_03)
   added: (pred_4 obj_11 obj_13)
   goals met: 2 of 3
8. (op_1 obj_11 obj_07 obj_13 obj_08)
   deleted: (pred_2 obj_11 obj_07 obj_08)
   added: (pred_3 obj_07 obj_13) (pred_1 obj_11 obj_08)
   goals met: 3 of 3
